Hi, @quixoticmonk

The purposed configuration still forces replacemen in my case, the awscc provider version is `v1.13.0` and terraform version `1.9.1`:

Resource code:
```hcl
resource "awscc_healthlake_fhir_datastore" "this" {
  datastore_type_version = "R4"
  datastore_name         = var.datastore_name
  tags                   = [
    for key, value in var.tags : {
      key   = key
      value = value
    }
  ]

  sse_configuration = {
    kms_encryption_config = {
      cmk_type = "AWS_OWNED_KMS_KEY"
    }
  }

  identity_provider_configuration = {
    authorization_strategy = "AWS_AUTH"
    fine_grained_authorization_enabled = false

  }
}
```

Plan:
```hcl
  # awscc_healthlake_fhir_datastore.this must be replaced
-/+ resource "awscc_healthlake_fhir_datastore" "this" {
      ~ created_at                      = {
          ~ nanos   = 424000000 -> (known after apply)
          ~ seconds = "1726076879" -> (known after apply)
        } -> (known after apply)
      ~ datastore_arn                   = "arn:aws:healthlake:us-east-1:123456789012:datastore/fhir/abcdefg1234567890acbdefg12345678" -> (known after apply)
      ~ datastore_endpoint              = "https://healthlake.us-east-1.amazonaws.com/datastore/abcdefg1234567890acbdefg12345678/r4/" -> (known after apply)
      ~ datastore_id                    = "abcdefg1234567890acbdefg12345678" -> (known after apply)
      ~ datastore_status                = "ACTIVE" -> (known after apply)
      ~ id                              = "abcdefg1234567890acbdefg12345678" -> (known after apply)
      ~ identity_provider_configuration = { # forces replacement
          ~ authorization_strategy             = "AWS_AUTH" -> (known after apply)
          ~ fine_grained_authorization_enabled = false -> (known after apply)
          + idp_lambda_arn                     = (known after apply)
          + metadata                           = (known after apply)
        } -> (known after apply) # forces replacement
      + preload_data_config             = (known after apply)
      ~ sse_configuration               = { # forces replacement
          ~ kms_encryption_config = {
              ~ cmk_type   = "AWS_OWNED_KMS_KEY" -> (known after apply)
              + kms_key_id = (known after apply)
            } -> (known after apply)
        } -> (known after apply) # forces replacement
      ~ tags                            = [
          ~ {
              ~ key   = "tag1" -> "tag2"
              ~ value = "value1" -> "value2"
            },
          ~ {
              ~ key   = "tag2" -> "tag3"
              ~ value = "value2" -> "value3"
            },
            {
                key   = "tag3"
                value = "value3"
            },
          ~ {
              ~ key   = "tag4" -> "tag1"
              ~ value = "value4" -> "value1"
            },
        ]
        # (2 unchanged attributes hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.
```

State:
```json
{
  "version": 4,
  "terraform_version": "1.9.1",
  "serial": 7,
  "lineage": "97e7c6c9-6182-099f-0708-cc7658a1863c",
  "outputs": {
    "datastore_arn": {
      "value": "arn:aws:healthlake:us-east-1:123456789012:datastore/fhir/abcdefg1234567890acbdefg12345678",
      "type": "string"
    },
    "datastore_id": {
      "value": "abcdefg1234567890acbdefg12345678",
      "type": "string"
    }
  },
  "resources": [
    {
      "mode": "managed",
      "type": "awscc_healthlake_fhir_datastore",
      "name": "this",
      "provider": "provider[\"registry.terraform.io/hashicorp/awscc\"]",
      "instances": [
        {
          "schema_version": 1,
          "attributes": {
            "created_at": {
              "nanos": 424000000,
              "seconds": "1726076879"
            },
            "datastore_arn": "arn:aws:healthlake:us-east-1:123456789012:datastore/fhir/abcdefg1234567890acbdefg12345678",
            "datastore_endpoint": "https://healthlake.us-east-1.amazonaws.com/datastore/abcdefg1234567890acbdefg12345678/r4/",
            "datastore_id": "abcdefg1234567890acbdefg12345678",
            "datastore_name": "fhir_poc",
            "datastore_status": "ACTIVE",
            "datastore_type_version": "R4",
            "id": "abcdefg1234567890acbdefg12345678",
            "identity_provider_configuration": {
              "authorization_strategy": "AWS_AUTH",
              "fine_grained_authorization_enabled": false,
              "idp_lambda_arn": null,
              "metadata": null
            },
            "preload_data_config": null,
            "sse_configuration": {
              "kms_encryption_config": {
                "cmk_type": "AWS_OWNED_KMS_KEY",
                "kms_key_id": null
              }
            },
            "tags": [
              {
                "key": "tag1",
                "value": "value1"
              },
              {
                "key": "tag2",
                "value": "value2"
              },
              {
                "key": "tag3",
                "value": "value3"
              },
              {
                "key": "tag4",
                "value": "value4"
              }
            ]
          },
          "sensitive_attributes": []
        }
      ]
    }
  ],
  "check_results": null
}
```


Also, interestingly enough, without explicit `identity_provider_configuration` and `sse_configuration` configuration, no tags are changed:

```hcl
 # awscc_healthlake_fhir_datastore.this will be updated in-place
  ~ resource "awscc_healthlake_fhir_datastore" "this" {
        id                              = "abcdefg1234567890acbdefg12345678"
      + preload_data_config             = (known after apply)
        tags                            =  [
             {
               "key": "tag1",
               "value": "value1"
             },
             {
               "key": "tag2",
               "value": "value2"
             },
             {
               "key": "tag3",
               "value": "value3"
             },
             {
               "key": "tag4",
               "value": "value4"
             }
        ]
        # (9 unchanged attributes hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.
```